app/views/simpanan_histories/_form.html.erb

SELECT "tipe_simpanans".* FROM "tipe_simpanans"
---
    <%= f.label :tipe_simpanan %>
    <%= f.collection_select(:tipe_simpanan_id, TipeSimpanan.all, :id, :name, include_blank: false) %>

SELECT "users".* FROM "users"
---
    <%= f.label :nasabah %>
    <%= f.collection_select(:nasabah_id, User.all, :id, :email, include_blank: false) %>