app/views/penarikan_histories/_form.html.erb

    <%= f.label :tipe_penarikan %>
    <%= f.collection_select(:tipe_penarikan_id, TipePenarikan.all, :id, :name, include_blank: false) %>
---
SELECT "tipe_penarikans".* FROM "tipe_penarikans"

    <%= f.label :nasabah %>
    <%= f.collection_select(:nasabah_id, User.all, :id, :email, include_blank: false) %>
---
SELECT "users".* FROM "users"