app/controllers/penarikan_histories_controller.rb

  def index
    @penarikan_histories = PenarikanHistory.all
---
SELECT "penarikan_histories".* FROM "penarikan_histories"

  def create
    @penarikan_history = PenarikanHistory.new(penarikan_history_params)

    respond_to do |format|
      if @penarikan_history.save
---
INSERT INTO "penarikan_histories" ("nilai_penarikan", "catatan", "tipe_penarikan_id", "nasabah_id", "petugas_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_penarikan_history
      @penarikan_history = PenarikanHistory.find(params[:id])
---
SELECT  "penarikan_histories".* FROM "penarikan_histories" WHERE "penarikan_histories"."id" = ? LIMIT 1  [["id", 1]]