app/controllers/simpanan_histories_controller.rb

  def index
    @simpanan_histories = SimpananHistory.all
---
SELECT "simpanan_histories".* FROM "simpanan_histories"

  def create
    @simpanan_history = SimpananHistory.new(simpanan_history_params)
    @simpanan_history.petugas_id = current_user.id

    respond_to do |format|
      if @simpanan_history.save
---
INSERT INTO "simpanan_histories" ("nilai_simpanan", "catatan", "tipe_simpanan_id", "nasabah_id", "petugas_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_simpanan_history
      @simpanan_history = SimpananHistory.find(params[:id])
---
SELECT  "simpanan_histories".* FROM "simpanan_histories" WHERE "simpanan_histories"."id" = ? LIMIT 1  [["id", 2]]