app/controllers/tipe_penarikans_controller.rb

SELECT "tipe_penarikans".* FROM "tipe_penarikans"
---
  def index
    @tipe_penarikans = TipePenarikan.all

INSERT INTO "tipe_penarikans" ("ident_name", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ident_name", "PENARIKAN_BIASA"], ["name", "Penarikan Biasa"], ["created_at", "2017-02-21 14:18:02.655164"], ["updated_at", "2017-02-21 14:18:02.655164"]]
---
  def create
    @tipe_penarikan = TipePenarikan.new(tipe_penarikan_params)

    respond_to do |format|
      if @tipe_penarikan.save

SELECT  "tipe_penarikans".* FROM "tipe_penarikans" WHERE "tipe_penarikans"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_tipe_penarikan
      @tipe_penarikan = TipePenarikan.find(params[:id])