app/controllers/tipe_simpanans_controller.rb

SELECT "tipe_simpanans".* FROM "tipe_simpanans"
---
  def index
    @tipe_simpanans = TipeSimpanan.all

INSERT INTO "tipe_simpanans" ("ident_name", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ident_name", "SIMPANAN_POKOK"], ["name", "Simpanan Pokok"], ["created_at", "2017-02-19 14:18:33.787860"], ["updated_at", "2017-02-19 14:18:33.787860"]]
---
  def create
    @tipe_simpanan = TipeSimpanan.new(tipe_simpanan_params)

    respond_to do |format|
      if @tipe_simpanan.save

SELECT  "tipe_simpanans".* FROM "tipe_simpanans" WHERE "tipe_simpanans"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_tipe_simpanan
      @tipe_simpanan = TipeSimpanan.find(params[:id])