app/controllers/tipe_nasabahs_controller.rb

SELECT "tipe_nasabahs".* FROM "tipe_nasabahs"
---
  def index
    @tipe_nasabahs = TipeNasabah.all

INSERT INTO "tipe_nasabahs" ("ident_name", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["ident_name", "BIASA"], ["name", "Biasa"], ["created_at", "2017-02-21 14:08:52.806015"], ["updated_at", "2017-02-21 14:08:52.806015"]]
---
  def create
    @tipe_nasabah = TipeNasabah.new(tipe_nasabah_params)

    respond_to do |format|
      if @tipe_nasabah.save

DELETE FROM "tipe_nasabahs" WHERE "tipe_nasabahs"."id" = ?  [["id", 2]]
---
  def destroy
    @tipe_nasabah.destroy

SELECT  "tipe_nasabahs".* FROM "tipe_nasabahs" WHERE "tipe_nasabahs"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_tipe_nasabah
      @tipe_nasabah = TipeNasabah.find(params[:id])