app/controllers/transaksi_histories_controller.rb

  def index
    @transaksi_histories = TransaksiHistory.all
---
SELECT "transaksi_histories".* FROM "transaksi_histories"

  def destroy
    @transaksi_history.destroy
---
DELETE FROM "transaksi_histories" WHERE "transaksi_histories"."id" = ?  [["id", 2]]

    def set_transaksi_history
      @transaksi_history = TransaksiHistory.find(params[:id])
---
SELECT  "transaksi_histories".* FROM "transaksi_histories" WHERE "transaksi_histories"."id" = ? LIMIT 1  [["id", 2]]